Documents/ESB/ESB_Consumer_0608/003TestSample/SAMPLE_XML_MUST/Limit/LI01_LmtAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/Limit/LmtAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>Limit</ServiceDomain>  
      <OperationName>LmtAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:LmtAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>LI01</v11:TxnId>  
        <v11:TxnNo>LI0100001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <v11:ArrngId>NEW</v11:ArrngId>  
        <!--Zero or more repetitions:-->  
        <v11:CustRec> 
          <!--Optional:-->  
          <v11:CIFNo>1000000013</v11:CIFNo> 
        </v11:CustRec>  
        <v11:ProdName>AC.DCS</v11:ProdName>  
        <!--Optional:-->  
        <v11:Ccy>TWD</v11:Ccy>  
        <!--Optional:-->  
        <v11:RsnCode>Open DCS AC</v11:RsnCode>  
        <!--Optional:-->  
        <v11:MainAcctNo>88691223344556</v11:MainAcctNo>  
        <!--Optional:-->  
        <v11:LmtInfo> 
          <!--Optional:-->  
          <v11:LmtSeqNo>1000000429</v11:LmtSeqNo> 
        </v11:LmtInfo>  
        <!--Optional:-->  
        <v11:IPAddr>IP.172.20.15.192</v11:IPAddr>  
        <!--Optional:-->  
        <v11:DevNo>1</v11:DevNo>  
        <!--Optional:-->  
        <v11:EntryDeptCode>N01</v11:EntryDeptCode>  
        <!--Optional:-->  
        <v11:PrftCntr>N01</v11:PrftCntr>  
        <!--Optional:-->  
        <v11:CostCntr>N01</v11:CostCntr>  
        <!--Optional:-->  
        <v11:AuthEmpId>HELEN</v11:AuthEmpId>  
        <!--Optional:-->  
        <v11:VerName>AA.ARRANGEMENT.ACTIVITY</v11:VerName>  
        <!--Optional:-->  
        <v11:EcoUnit>N01</v11:EcoUnit>  
        <!--Optional:-->  
        <v11:APIKey>NCB-IF01003</v11:APIKey>  
        <!--Optional:-->  
        <v11:MobLang>ENGLISH</v11:MobLang> 
      </v11:ServiceBody> 
    </v11:LmtAddRq> 
  </soap:Body> 
</soap:Envelope>
